#### OpenTofu Format and Style 🖌`failure`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
cloudflare_record.subdomain["kuma"]: Refreshing state... [id=f0c18c8737324e64289ad3c1a8dda02d]
cloudflare_record.subdomain["actual"]: Refreshing state... [id=095556f6ce4fae51b9efea987dcd8bf4]
cloudflare_record.subdomain["sonar"]: Refreshing state... [id=4b908718959902580ca7066793ba4cb0]
cloudflare_record.subdomain["sabnzbd"]: Refreshing state... [id=e2071752162925f6af6fd43c980515e0]
cloudflare_record.subdomain["minio"]: Refreshing state... [id=539f16596fa93584a16e5ad95536a80c]
cloudflare_record.subdomain["jacket"]: Refreshing state... [id=be30be09f60d69575948dccf41e91e4e]
cloudflare_record.subdomain["portainer"]: Refreshing state... [id=81db214999e14753b1b92f135ebb4f93]
cloudflare_record.subdomain["radar"]: Refreshing state... [id=971e57592e0b86e111cea8d23a676fa6]
cloudflare_record.subdomain["npm"]: Refreshing state... [id=def4c273e28c0d68c5110b598f72a300]
cloudflare_record.subdomain["compartilhado"]: Refreshing state... [id=ae54e9d25eb2cc5e57c66eb536c15467]
cloudflare_record.subdomain["bazar"]: Refreshing state... [id=a5f5a62bb3118b0bc8c05b6506af9e2d]
cloudflare_record.subdomain["transmission"]: Refreshing state... [id=3638f994587bdb680ddfa105d732e6fb]
cloudflare_record.subdomain["home"]: Refreshing state... [id=58c83d9edadeb6a449932f8d116b5123]
cloudflare_record.subdomain["prowlarr"]: Refreshing state... [id=d11d4ffabb2d81182e722ab1d05da04c]
cloudflare_record.subdomain["wyl"]: Refreshing state... [id=8dc8fc871fc3dd7c728116485f325260]
cloudflare_record.subdomain["readar"]: Refreshing state... [id=14f9071c4125477bbb73b7d25f9ebe39]
cloudflare_record.subdomain["jellyfin"]: Refreshing state... [id=60b89b1e7dd378bc69f078c17867c05e]
cloudflare_record.subdomain["comp-netdata"]: Refreshing state... [id=e48f9d510d4e5150ce9d4d4a10c6a675]
cloudflare_record.subdomain["minio-data"]: Refreshing state... [id=2836081656e047fa0dbe212ab2bcccaf]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_record.subdomain["tandoor"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tandoor.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (sensitive value)
      + zone_id         = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with cloudflare_record.subdomain["sonar"],
  on dns.tf line 33, in resource "cloudflare_record" "subdomain":
  33:   value    = var.npm_ip

`value` is deprecated in favour of `content` and will be removed in the next
major release.

(and 19 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @guilhermewolf, Action: `pull_request`, Working Directory: ``, Workflow: `OpenTofu Plan`*